{
  "nodes": [
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(15, 0, 6, 6)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(15,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(6, 6)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "15", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv0_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "layout": "NCHW", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.25"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30, 0, 9, 9)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(9, 9)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "30", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "layout": "NCHW", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.25"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0_flatten0", 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense0_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "128"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "dense0_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout2_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense1_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "32"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "dense1_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(6, 6)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "15", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv0_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "layout": "NCHW", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.25"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(9, 9)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "30", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "layout": "NCHW", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.25"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0_flatten0", 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense0_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "128"
      }, 
      "inputs": [[32, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "dense0_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout2_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense1_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "32"
      }, 
      "inputs": [[35, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "dense1_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "siamesenetwork0__minus0", 
      "inputs": [[22, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "norm", 
      "name": "siamesenetwork0_norm0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[38, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 7, 8, 14, 15, 19, 20, 23], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    7, 
    9, 
    10, 
    11, 
    12, 
    13, 
    15, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    33, 
    35, 
    36, 
    37, 
    39, 
    41, 
    42, 
    43, 
    44, 
    46, 
    47, 
    48, 
    49, 
    50
  ], 
  "heads": [[39, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}